In [358]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler
from sklearn.impute import SimpleImputer # import fungsi simpleimputer 
from sklearn.preprocessing import OrdinalEncoder # import fungsi ordinal
from sklearn.preprocessing import OneHotEncoder # import fungsi one hot encoder

In [359]:
df = pd.read_csv('Forbes Top2000 2017.csv')
df.head()

,Unnamed: 0,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry
0,NaN,1,ICBC,China,151.4,42.0,3473.2,229.8,Financials,Major Banks
1,NaN,2,China Construction Bank,China,134.2,35.0,3016.6,200.5,Financials,Regional Banks
2,NaN,3,Berkshire Hathaway,United States,222.9,24.1,620.9,409.9,Financials,Investment Services
3,NaN,4,JPMorgan Chase,United States,102.5,24.2,2513.0,306.6,Financials,Major Banks
4,NaN,5,Wells Fargo,United States,97.6,21.9,1943.4,274.4,Financials,Major Banks

## Mengecek tipe data

In [360]:
df.dtypes

Unnamed: 0      float64
 Rank             int64
Company          object
Country          object
Sales           float64
Profits         float64
Assets          float64
Market Value    float64
Sector           object
Industry         object
dtype: object

## Membagi dataset menjadi training set dan testing set dengan proporsi 70:30

#### dataset akan dimasukkan ke variabel dataset_split dan akan dibagi menjadi training set dan testing set

In [361]:
dataset_split = pd.read_csv('Forbes Top2000 2017.csv')
dataset_split.head()

,Unnamed: 0,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry
0,NaN,1,ICBC,China,151.4,42.0,3473.2,229.8,Financials,Major Banks
1,NaN,2,China Construction Bank,China,134.2,35.0,3016.6,200.5,Financials,Regional Banks
2,NaN,3,Berkshire Hathaway,United States,222.9,24.1,620.9,409.9,Financials,Investment Services
3,NaN,4,JPMorgan Chase,United States,102.5,24.2,2513.0,306.6,Financials,Major Banks
4,NaN,5,Wells Fargo,United States,97.6,21.9,1943.4,274.4,Financials,Major Banks

#### panjang record dan atribut

In [362]:
dataset_split.shape

(2000, 10)

## Membagi ke 2 var x dan y dengan proporsi 70:30

In [363]:
x = dataset_split.iloc[:, :-1]
y = dataset_split.iloc[:, -1]

In [364]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.3)

print('Dimensi x_train : ', x_train.shape)
print('Dimensi x_test  : ', x_test.shape)
print('Dimensi y_train : ', y_train.shape)
print('Dimensi y_test  : ', y_test.shape)

Dimensi x_train :  (1400, 9)
Dimensi x_test  :  (600, 9)
Dimensi y_train :  (1400,)
Dimensi y_test  :  (600,)

## Normalisasi pada salah satu atribut (copy dataset terlebih dahulu)

In [365]:
datasetCopyNorm = df.copy()

In [366]:
min_max_scaler = MinMaxScaler()

In [367]:
x_norm = min_max_scaler.fit_transform(
    dataset_split[['Assets']]
)

In [368]:
dataNormalisasi = pd.DataFrame(x_norm)

In [369]:
dataNormalisasi.head()

          0
0  1.000000
1  0.868536
2  0.178769
3  0.723540
4  0.559542

## Lakukan standarisasi pada dataset (copy dataset terlebih dahulu)

In [370]:
datasetCopyNorm = dataset_split.copy()

#### dataset sebelum dilakukan standarisasi menggunakan scaling

In [371]:
print('Nilai standarisasi sebelum dilakukan scaling: ')
np.std(dataset_split)

Nilai standarisasi sebelum dilakukan scaling:

C:\Users\sherina laraswati\venv_A2-21\Sherina_050\lib\site-packages\numpy\core\fromnumeric.py:3571: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return std(axis=axis, dtype=dtype, out=out, ddof=ddof, **kwargs)

Unnamed: 0             NaN
 Rank           577.350197
Sales            29.312785
Profits           2.918012
Assets          260.919234
Market Value     44.750208
dtype: float64

In [372]:
from sklearn.preprocessing import StandardScaler

In [373]:
standard_scaler = StandardScaler()

In [374]:
x_standard = standard_scaler.fit_transform(
    dataset_split[['Sales', 'Profits', 'Assets', 'Market Value']]
)

In [375]:
print('Nilai sesudah dilakukan scaling')
np.std(x_standard)

Nilai sesudah dilakukan scaling

0.9999999999999999

In [376]:
data_standarisasi = pd.DataFrame(x_standard)

In [377]:
data_standarisasi.head()

          0          1          2         3
0  4.562360  13.968168  12.987415  4.589524
1  3.975586  11.569275  11.237448  3.934779
2  7.001569   7.833855   2.055680  8.614086
3  2.894146   7.868125   9.307349  6.305717
4  2.726984   7.079917   7.124298  5.586167

## Data cleaning pada data dengan nilai null. Ganti niali null sesuai ketentuan (bil. bulat: medain/modus, bil.desimal: mean, tulisan: modus)

#### Mengecek nilai null

In [378]:
df.isnull().sum()

Unnamed: 0      2000
 Rank              0
Company            0
Country            0
Sales              0
Profits            0
Assets             0
Market Value       0
Sector           197
Industry         491
dtype: int64

#### data cleaning mengubah nilai null type objek menjadi modus

In [379]:
simpleImputerObjek = SimpleImputer(strategy = 'most_frequent')

In [380]:
df['Sector'] = simpleImputerObjek.fit_transform(df[['Sector']])
df['Industry'] = simpleImputerObjek.fit_transform(df[['Industry']])

In [381]:
df.isna().sum()

Unnamed: 0      2000
 Rank              0
Company            0
Country            0
Sales              0
Profits            0
Assets             0
Market Value       0
Sector             0
Industry           0
dtype: int64

#### Membuat data duplicate

In [382]:
duplicate1 = pd.DataFrame([[2, 'ICBC', 'China', 151.4, 42, 3473.2, 229.8, 
                           'Financials', 'Major Banks']],
                        columns =['Rank', 'Company', 'Countrty', 'Sales', 'Profits', 
                                  'Assets','Market Value', 'Sector', 'Industry'])


duplicate2 = pd.DataFrame([[2, 'ICBC', 'China', 151.4, 42, 3473.2, 229.8, 
                           'Financials', 'Major Banks']],
                        columns =['Rank', 'Company', 'Countrty', 'Sales', 'Profits', 
                                  'Assets','Market Value', 'Sector', 'Industry'])
             
df = df.append([duplicate1, duplicate2], ignore_index=True)

C:\Users\sherina laraswati\AppData\Local\Temp\ipykernel_17084\2887932323.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append([duplicate1, duplicate2], ignore_index=True)

In [383]:
df[df.duplicated()]

,Unnamed: 0,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry,Rank,Countrty
2001,NaN,NaN,ICBC,NaN,151.4,42.0,3473.2,229.8,Financials,Major Banks,2.0,China

#### menghapus data duplicate

In [384]:
df.drop_duplicates(inplace = True)

In [385]:
df[df.duplicated()]

Empty DataFrame
Columns: [Unnamed: 0,  Rank, Company, Country, Sales, Profits, Assets, Market Value, Sector, Industry, Rank, Countrty]
Index: []

In [386]:
df.duplicated().sum()

0

## ganti salah satu atribut angka

In [387]:
df.dtypes

Unnamed: 0      float64
 Rank           float64
Company          object
Country          object
Sales           float64
Profits         float64
Assets          float64
Market Value    float64
Sector           object
Industry         object
Rank            float64
Countrty         object
dtype: object

In [388]:
df['Sales'] = df['Sales'].astype('int64')

In [389]:
df.dtypes

Unnamed: 0      float64
 Rank           float64
Company          object
Country          object
Sales             int64
Profits         float64
Assets          float64
Market Value    float64
Sector           object
Industry         object
Rank            float64
Countrty         object
dtype: object

## One hot encoding

In [390]:
oneHotEncoder = OneHotEncoder(sparse = False)
onehot = oneHotEncoder.fit_transform(df[['Country']])

In [391]:
dataonehot = pd.DataFrame(onehot)

In [392]:
df = df.join(dataonehot)

In [393]:
df.head()

,Unnamed: 0,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry,...,52,53,54,55,56,57,58,59,60,61
0,NaN,1.0,ICBC,China,151,42.0,3473.2,229.8,Financials,Major Banks,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,NaN,2.0,China Construction Bank,China,134,35.0,3016.6,200.5,Financials,Regional Banks,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,NaN,3.0,Berkshire Hathaway,United States,222,24.1,620.9,409.9,Financials,Investment Services,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,NaN,4.0,JPMorgan Chase,United States,102,24.2,2513.0,306.6,Financials,Major Banks,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
4,NaN,5.0,Wells Fargo,United States,97,21.9,1943.4,274.4,Financials,Major Banks,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0

In [394]:
df.to_csv('Praktikum_KB_4')